In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('/Users/nikhilvarma/Downloads/Salaries.csv')
data.head(2)

/var/folders/y2/mht9wcf123s0h5jxcn51h5t80000gn/T/ipykernel_12419/2132841750.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv('/Users/nikhilvarma/Downloads/Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [3]:
#DROP ID, NOTES, AGENCY, STATUS COLUMNS

data = data.drop(['Id','Notes','Agency','Status'],axis = 1)
data

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011
...,...,...,...,...,...,...,...,...,...
148649,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014
148650,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014
148653,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014

In [4]:
 a = data.describe(include = 'all')

In [5]:
#FINIDING TOP5 OCCURENCES OF THE EMPLOYEE NAMES
data['EmployeeName'].value_counts().head(5)

EmployeeName
Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: count, dtype: int64

In [6]:
#NUMBER OF UNIQUE JOBS

#OR WE CAN USE data['JobTitle'].value_counts().count()

data['JobTitle'].nunique()

2159

In [7]:
#NUMBER OF JOBS WITH CAPTAIN IN THEIR TITLE
len(data[data['JobTitle'].str.contains('CAPTAIN',case=False )])

552

In [8]:
#DISPLAY ALL THE EMPLOYEE NAMES FROM FIRE DEPARTMENT
data[data['JobTitle'].str.contains("Fire Department",case = False)]['EmployeeName']

4              PATRICK GARDNER
6                    ALSON LEE
8               MICHAEL MORRIS
9           JOANNE HAYES-WHITE
10               ARTHUR KENNEY
                  ...
32623             JAMES BARDEN
36162       Joanne Hayes-White
72926     Joanne M Hayes-White
102303          Robert E Evans
110535    Joanne M Hayes-White
Name: EmployeeName, Length: 226, dtype: object

In [9]:
#FIND MIN, MAX AND AVERAGE BASEPAY
data.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [26]:
#REPLACING THE " NOT PROVIDED" NAMES WITH NAN
import numpy as np
data['EmployeeName'] = data['EmployeeName'].replace('Not provided',np.nan)
data['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [40]:
#DROP THE ROWS HAVING 5 MISSING VALUES
data.drop(data[data.isnull().sum(axis = 1) == 5].index,axis=0,inplace=True)

In [32]:
#FIND THE JOB TITLE OF ALBERT PARDINI
data[data['EmployeeName'] == "ALBERT PARDINI"]['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

In [72]:
#HOW MUCH DOES ALBERT PARDININ MAKE AFTER BENEFITS
data[data['EmployeeName'] == "ALBERT PARDINI"]['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

In [170]:
#WHAT IS THE H

data['BasePay'].replace('Not Provided', np.nan,inplace =True)
data['BasePay'].fillna(0,inplace = True)
data['BasePay'] = pd.to_numeric(data['BasePay'], errors='coerce')
idx = data['BasePay'].idxmax()
data['EmployeeName'][idx]
data['BasePay'][idx]

319275.01